var provinceName = ["北京市","上海市","天津市","重庆市","河北省","山西省","辽宁省","吉林省","河南省","江苏省","浙江省","安徽省","福建省","江西省","山东省","湖北省","湖南省","广东省","海南省","四川省","贵州省","云南省","陕西省","甘肃省","青海省","黑龙江省","内蒙古自治区","广西壮族自治区","西藏自治区","宁夏回族自治区","新疆维吾尔自治区","台湾省","香港特别行政区","澳门特别行政区","其它"];

//北京市辖区名称
//var city1 = ["东城区","西城区","崇文区","宣武区","朝阳区","海淀区","丰台区","石景山区","房山区","通州区","顺义区","门头沟区","昌平区","大兴区","怀柔区","平谷区","密云县","延庆县"];
var city1 = ["北京市"];
//上海市辖区名称
//var city2 = ["黄浦区","卢湾区","徐汇区","长宁区","静安区","普陀区","闸北区","虹口区","杨浦区","宝山区","闵行区","嘉定区","浦东新区","金山区","松江区","青浦区","南汇区","奉贤区","崇明县"];
var city2 = ["上海市"];
//天津市辖区名称
//var city3 = ["和平区","河东区","河西区","南开区","河北区","红桥区","塘沽区","汉沽区","大港区","东丽区","西青区","津南区","北辰区","武清区","宝坻区","宁河县","静海县","蓟县"];
var city3 = ["天津市"];
//重庆市辖区名称
//var city4 = ["渝中区","大渡口区","江北区","沙坪坝区","九龙坡区","南岸区","北碚区","万盛区","双桥区","渝北区","巴南区","万县区","涪陵区","永川市","合川市","江津市","南川市","长寿县","綦江县","潼南县","荣昌县","壁山县","大足县","铜梁县","梁平县","城口县","垫江县","武隆县","丰都县","忠 县","开 县","云阳县","青龙镇青龙嘴","奉节县","巫山县","巫溪县","南宾镇","中和镇","钟多镇","联合镇","汉葭镇"];
var city4 = ["重庆市"];
//河北省主要城市名称
var city5 = ["石家庄市","唐山市","秦皇岛市","邯郸市","邢台市","保定市","张家口市","承德市","沧州市","廊坊市","衡水市"];
//山西省主要城市名称
var city6 = ["太原市","大同市","阳泉市","长治市","晋城市","朔州市","晋中市","运城市","忻州市","临汾市","吕梁市"];
//辽宁省主要城市名称
var city7 = ["沈阳市","大连市","鞍山市","抚顺市","本溪市","丹东市","锦州市","营口市","阜新市","辽阳市","盘锦市","铁岭市","朝阳市","葫芦岛市"];
//吉林省主要城市名称
var city8 = ["长春市","吉林市","四平市","辽源市","通化市","白山市","松原市","白城市","延边朝鲜族自治州"];
//河南省主要城市名称
var city9 = ["郑州市","开封市","洛阳市","平顶山市","安阳市","鹤壁市","新乡市","焦作市","濮阳市","许昌市","漯河市","三门峡市","南阳市","商丘市","信阳市","周口市","驻马店市","济源市"];
//江苏省主要城市名称
var city10 = ["南京市","无锡市","徐州市","常州市","苏州市","南通市","连云港市","淮安市","盐城市","扬州市","镇江市","泰州市","宿迁市"];
//浙江省主要城市名称
var city11 = ["杭州市","宁波市","温州市","嘉兴市","湖州市","绍兴市","金华市","衢州市","舟山市","台州市","丽水市"];
//安徽省主要城市名称
var city12 = ["合肥市","芜湖市","蚌埠市","淮南市","马鞍山市","淮北市","铜陵市","安庆市","黄山市","滁州市","阜阳市","宿州市","巢湖市","六安市","亳州市","池州市","宣城市"];
//福建省主要城市名称
var city13 = ["福州市","厦门市","莆田市","三明市","泉州市","漳州市","南平市","龙岩市","宁德市"];
//江西省主要城市名称
var city14 = ["南昌市","景德镇市","萍乡市","九江市","新余市","鹰潭市","赣州市","吉安市","宜春市","抚州市","上饶市"];
//山东省主要城市名称
var city15 = ["济南市","青岛市","淄博市","枣庄市","东营市","烟台市","潍坊市","威海市","济宁市","泰安市","日照市","莱芜市","临沂市","德州市","聊城市","滨州市","菏泽市"];
//湖北省主要城市名称
var city16 = ["武汉市","黄石市","襄樊市","十堰市","荆州市","宜昌市","荆门市","鄂州市","孝感市","黄冈市","咸宁市","随州市","恩施州","仙桃市","潜江市","天门市","神农架林区"];
//湖南省主要城市名称
var city17 = ["长沙市","株洲市","湘潭市","衡阳市","邵阳市","岳阳市","常德市","张家界市","益阳市","郴州市","永州市","怀化市","娄底市","湘西州"];
//广东省主要城市名称
var city18 = ["广州市","深圳市","珠海市","汕头市","韶关市","佛山市","江门市","湛江市","茂名市","肇庆市","惠州市","梅州市","汕尾市","河源市","阳江市","清远市","东莞市","中山市","潮州市","揭阳市","云浮市"];
//海南省主要城市名称
var city19 = ["海口市","三亚市"];
//四川省主要城市名称
var city20 = ["成都市","自贡市","攀枝花市","泸州市","德阳市","绵阳市","广元市","遂宁市","内江市","乐山市","南充市","宜宾市","广安市","达州市","眉山市","雅安市","巴中市","资阳市","阿坝州","甘孜州","凉山州"];
//贵州省主要城市名称
var city21 = ["贵阳市","六盘水市","遵义市","安顺市","铜仁地区","毕节地区","黔西南州","黔东南州","黔南州"];
//云南省主要城市名称
var city22 = ["昆明市","大理市","曲靖市","玉溪市","昭通市","楚雄市","红河市","文山市","思茅市","西双版纳市","保山市","德宏市","丽江市","怒江市","迪庆市","临沧市"];
//陕西省主要城市名称
var city23 = ["西安市","铜川市","宝鸡市","咸阳市","渭南市","延安市","汉中市","榆林市","安康市","商洛市"];
//甘肃省主要城市名称
var city24 = ["兰州市","嘉峪关市","金昌市","白银市","天水市","武威市","张掖市","平凉市","酒泉市","庆阳市","定西市","陇南市","临夏州","甘南州"];
//青海省主要城市名称
var city25 = ["西宁市","海东地区","海北州","黄南州","海南州","果洛州","玉树州","海西州"];
//黑龙江省主要城市名称
var city26 = ["哈尔滨市","齐齐哈尔市","鸡西市","鹤岗市","双鸭山市","大庆市","伊春市","佳木斯市","七台河市","牡丹江市","黑河市","绥化市","大兴安岭地区"];
//内蒙古自治区主要城市名称
var city27 = ["呼和浩特市","包头市","乌海市","赤峰市","通辽市","鄂尔多斯市","呼伦贝尔市","巴彦淖尔市","乌兰察布市","兴安盟","锡林郭勒盟","阿拉善盟"];
//广西壮族自治区主要城市名称
var city28 = ["南宁市","柳州市","桂林市","梧州市","北海市","防城港市","钦州市","贵港市","玉林市","百色市","贺州市","河池市","来宾市","崇左市"];
//西藏自治区主要城市名称
var city29 = ["拉萨市","昌都地区","山南地区","日喀则地区","那曲地区","阿里地区","林芝地区"];
//宁夏回族自治区主要城市名称
var city30 = ["银川市","石嘴山市","吴忠市","固原市","中卫市"];
//新疆维吾尔自治区主要城市名称
var city31 = ["乌鲁木齐市","克拉玛依市","吐鲁番地区","哈密地区","和田地区","阿克苏地区","喀什地区","克孜勒苏柯尔克孜自治州","巴音郭楞蒙古自治州","昌吉回族自治州","博尔塔拉蒙古自治州","伊犁哈萨克自治州","塔城地区","阿勒泰地区","石河子市","阿拉尔市","图木舒克市","五家渠市"];
//台湾省主要城市名称
//var city32 = ["台北市","高雄市","基隆市","台中市","台南市","新竹市","嘉义市","台北县","宜兰县","桃园县","新竹县","苗栗县","台中县","彰化县","南投县","云林县","嘉义县","台南县","高雄县","屏东县","澎湖县","台东县","花莲县"];
var city32 = ["台湾地区"];
//香港特别行政区主要辖区名称
//var city33 = ["中西区","东区","九龙城区","观塘区","南区","深水埗区","黄大仙区","湾仔区","油尖旺区","离岛区","葵青区","北区","西贡区","沙田区","屯门区","大埔区","荃湾区","元朗区"];
var city33 = ["香港地区"];
//澳门地区
var city34 = ["澳门地区"];
//其它地区
var city35 = ["其它地区"];


var code1 = ["010"];
var code2 = ["021"];
var code3 = ["022"];
var code4 = ["0811"];
var code5 = ["0311","0315","0335","0310","0319","0312","0313","0314","0317","0316","0318"];
var code6 = ["0351","0352","0353","0355","0356","0349","0354","0359","0350","0357","0358"];
var code7 = ["024","0411","0412","0413","0414","0415","0416","0417","0418","0419","0427","0410","0421","0429"];
var code8 = ["0431","0432","0434","0437","0435","0439","0438","0436","0433"];
var code9 = ["0371","0378","0379","0375","0372","0392","0373","0391","03829","0374","0395","03891","0377","0370","0376","03851","03011","0391"];
var code10 = ["025","0510","0516","0519","0512","0513","0518","0517","0515","0514","0511","05241","05274"];
var code11 = ["0571","0574","0577","0573","0572","0575","0579","0570","05856","0576","0578"];
var code12 = ["0551","0553","0552","0554","0555","05600","05612","0556","0559","0550","0558","0557","05655","05645","0558","0566","0563"];
var code13 = ["0591","0592","0594","0598","0595","0596","0599","0597","0593"];
var code14 = ["0791","0798","0799","0792","0790","07032","0797","0796","0795","0794","0793"];
var code15 = ["0531","0532","0533","05471","05461","0535","0536","0896","0537","0538","05400","05481","0539","0534","05411","0543","0530"];
var code16 = ["027","0714","0710","0719","0716","0717","07267","0711","0712","0713","0715","07202","0718","07214","0728","07261","0719"];
var code17 = ["0731","0733","0732","0734","0739","0730","0736","0744","0737","0735","07401","07402","0738","0743"];
var code18 = ["020","0755","0756","0754","0751","0757","0750","0759","07683","0758","0752","0753","07647","07623","07677","07617","0769","0760","07681","0663","0766"];
var code19 = ["0898","0899"];
var code20 = ["028","0813","0812","0830","0838","0816","0839","08252","0832","0833","0817","0831","0826","0818","0833","0835","0827","0832","0837","0836","0834"];
var code21 = ["0851","0858","0852","0853","0856","0857","0859","0855","0854"];
var code22 = ["0871","0872","0874","0877","0870","0878","0873","0876","0879","0691","0875","0692","0888","0886","0887","0883"];
var code23 = ["029","0919","0917","0910","0913","0911","0916","0912","0915","0914"];
var code24 = ["0931","09477","09455","09430","0938","0935","0936","0933","0937","0934","0932","0939","0930","0941"];
var code25 = ["0971","0972","0978","0973","0974","0975","0976","0979"];
var code26 = ["0451","0452 ","04617","04618","0454","0459","0795","0454","04640","0453","0456","0455","0457"];
var code27 = ["0471","0472","0473","0476","0475","0471","0470","0478","0474 ","0482","0479","0483"];
var code28 = ["0771","0772","0773","0774","0779","0770","0777","0775","0775","0776","0774","0778","0772","0771"];
var code29 = ["0891","0895","0893","0892","0896","0897","0894"];
var code30 = ["0951","0952","0953","0954","0953"];
var code31 = ["0991","0990","0995","0902","0903","0997","0998","0908","0996","0994","0909","0992","0901","0906","0993","0997","0998 ","0994"];
var code32 = ["886"];
var code33 = ["00852"];
var code34 = ["00853"];
var code35 = ["0000"];

